# Напишите программу для печати всех уникальных значений в словаре. 
# Примечание: Список словарей задан изначально. Пользователь его не вводит

# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

dictionary = {"V": "S001", "V": "S002", "VI": "S001", "VI": "S005", "VII": " S005 ", " V ": " S009 ", " VIII": " S007 "}
diff = {'',}

for item in dictionary:
    diff.add(dictionary[item])
diff.discard('')

print(diff)